# CannotCopyByPatternFamilies Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..CannotCopyByPatternFamilies Property
BuiltInFailures..::..FamilyFailures Class See Also
---
Can't copy between Mass or Curtain Panel by Pattern families, and other families or Revit projects.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotCopyByPatternFamilies { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotCopyByPatternFamilies As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotCopyByPatternFamilies {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace